Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Change the address and port Change the address and port variables to suit your setup and execute.
es: ?php error_reporting( E_ALL); / * Allow the script to hang around waiting for connections. * / set_time_limit(0); $address = '192.168.1.53'; $port = 10000; if (($sock = socket(AF_INET, SOCK_STREAM, 0)) 0) {echo "socket() failed: reason: ". strerror($sock). "\n";} if (($ret = bind($sock, $address, $port)) 0) {echo "bind() failed: reason:". strerror($ret). "\n";} if (($ret = listen($sock, 5)) 0) {echo "listen() failed: reason: ". strerror($ret). "\n";} do {if (($msgsock = accept_connect($sock)) 0) {echo "accept_connect() failed: reason:". strerror($msgsock). "\n"; break;} do {$buf = ''; $ret = read($msgsock, $buf, 2048); if ($ret 0) {echo "read() failed: reason: ". strerror($ret). "\n"; break 2;} if ($ret == 0) {break 2;} $buf = trim($buf); if ($buf == 'quit') {close($msgsock); break 2;} $talkback = "PHP:

source: Anything you type will then be output on the server side, and echoed back to you.
es: You said '$buf'.\n"; write($msgsock, $talkback, strlen($talkback)); echo "$buf\n";} while (true); close($msgsock);} while (true); close($sock);?

source: To disconnect, enter 'quit'.
es: Ejemplo 2.

source: ?php error_reporting (E_ALL); echo "h2 TCP / IP Connection / h2 \n"; / * Get the port for the WWW service. * / $service_port = getservbyname ('www', 'tcp'); / * Get the IP address for the target host. * / $address = gethostbyname ('www.example.com'); / * Create a TCP / IP socket. * / $socket = socket_create (AF_INET, SOCK_STREAM, 0); if ($socket 0) {echo "socket_create() failed: reason:". socket_strerror ($socket). "\n";} else {echo "OK.\n";} echo "Attempting to connect to '$address' on port '$service_port'.. ."; $result = socket_connect ($socket, $address, $service_port); if ($result 0) {echo "socket_connect() failed.\nReason: ($result) ". socket_strerror($result). "\n";} else {echo "OK.\n";} $in = "HEAD / HTTP / 1.0\r\n\r\n"; $out = ''; echo "Sending HTTP HEAD request.. ."; socket_write ($socket, $in, strlen ($in)); echo "OK.\n"; echo "Reading response:\n\n"; while ($out = socket_read ($socket, 2048)) {echo $out;} echo "Closing socket.. ."; socket_close ($socket); echo "OK.\n\n";?
es: ?php error_reporting( E_ALL); echo "h2 TCP / IP Connection / h2 \n"; / * Get the port for the WWW service. * / $service_port = getservbyname('www', 'tcp'); / * Get the IP address for the target host. * / $address = gethostbyname('www.php.net'); / * Create a TCP / IP socket. * / $socket = socket(AF_INET, SOCK_STREAM, 0); if ($socket 0) {echo "socket() failed: reason:". strerror($socket). "\n";} else {"socket() successful: ". strerror($socket). "\n";} echo "Attempting to connect to '$address 'on port '$service_port'.. ."; $result = connect($socket, $address, $service_port); if ($result 0) {echo "connect() failed.\nReason: ($result)". strerror($result). "\n";} else {echo "OK.\n";} $in = "HEAD / HTTP / 1.0\r\n\r\n"; $out = ''; echo "Sending HTTP HEAD request.. ."; write($socket, $in, strlen($in)); echo "OK.\n"; echo "Reading response:\n\n"; while (read($socket, $out, 2048)) {echo $out;} echo "Closing socket.. ."; close($socket); echo "OK.\n\n";?

source: There are many wrappers built into PHP by default (See Appendix I), and additional, custom wrappers may be added either within a PHP script using stream_register_wrapper(), or directly from an extension using the API Reference in Chapter 43.
es: There are many wrappers built into PHP by default (See Apéndice I), and additional, custom wrappers may be added either within a PHP script using stream_register_wrapper(), or directly from an extension using the API Reference in Capítulo 43.

source: Custom filters can be defined in a PHP script using stream_register_filter() or in an extension using the API Reference in Chapter 43.
es: Custom filters can be defined in a PHP script using stream_register_filter() or in an extension using the API Reference in Capítulo 43.

source: See Appendix I for a list of PHP builtin wrappers.
es: See Apéndice I for a list of PHP builtin wrappers.

source: Again, see Appendix I for a description of targets for builtin streams.
es: Again, see Apéndice I for a description of targets for builtin streams.

source: For information on how strings behave, especially with regard to usage of single quotes, double quotes, and escape sequences, see the Strings entry in the Types section of the manual.
es: Todas estas funciones manipulan cadenas de varias maneras.

source: For even more powerful string handling and manipulating functions take a look at the POSIX regular expression functions and the Perl compatible regular expression functions.
es: En las secciones sobre expresiones regulares y manejo de URL se pueden encontrar secciones más especializadas.

source: For up to date SWF support take a look at the MING functions.
es: Once you have libswf all you need to do is to configure --with-swf[ =DIR] where DIR is a location containing the directories include and lib.

source: Once you 've successfully installed PHP with Shockwave Flash support you can then go about creating Shockwave files from PHP.
es: Ejemplo 1.

source: ?php swf_openfile ("test.swf", 256, 256, 30, 1, 1, 1); swf_ortho2 (-100, 100, -100, 100); swf_defineline (1, -70, 0, 70, 0, .2); swf_definerect (4, 60, -10, 70, 0, 0); swf_definerect (5, -60, 0, -70, 10, 0); swf_addcolor (0, 0, 0, 0); swf_definefont (10, "Mod"); swf_fontsize (5); swf_fontslant (10); swf_definetext (11, "This be Flash wit PHP !", 1); swf_pushmatrix (); swf_translate (-50, 80, 0); swf_placeobject (11, 60); swf_popmatrix (); for ($i = 0; $i 30; $i++) {$p = $i / (30-1); swf_pushmatrix (); swf_scale (1 -($p*.9), 1, 1); swf_rotate (60*$p, 'z'); swf_translate (20+20*$p, $p / 1.5, 0); swf_rotate (270*$p, 'z'); swf_addcolor ($p, 0, $p / 1.2, -$p); swf_placeobject (1, 50); swf_placeobject (4, 50); swf_placeobject (5, 50); swf_popmatrix (); swf_showframe ();} for ($i = 0; $i 30; $i++) {swf_removeobject (50); if (($i%4) == 0) {swf_showframe ();}} swf_startdoaction (); swf_actionstop (); swf_enddoaction (); swf_closefile ();?
es: Nota:

source: DIR is the Sybase home directory, defaults to / home / sybase.
es: Manual de PHP

source: The maximum number of Sybase connections per process, including persistent connections. -1 means no limit.
es: Siguiente

source: If on, this will cause PHP to automatically assign types to results according to their Sybase type, instead of treating them all as strings.
es: Anterior

source: If magic_quotes_sybase is on, a single-quote is escaped with a single-quote instead of a backslash if magic_quotes_gpc or magic_quotes_runtime are enabled.
es: Inicio

source: In this case even when magic_quotes_gpc is enabled neither double quotes, backslashes or NUL 's will be escaped.
es: Siguiente

source: This value can also be set from a script by calling sybase_min_server_severity().
es: Subir

source: Dealing with URL strings: encoding, decoding and parsing.
es: Anterior

source: token_name
es: Subir

source: Variables Configuration Options
es: Siguiente

source: A warning appears if the specified function is not defined, or if the function doesn 't include / implement the missing class.
es: Inicio

source: See also unserialize().
es: Siguiente

source: These functions are intended for work with WDDX.
es: Estas funciones permiten el uso de WDDX.

source: After installing expat compile PHP with --enable-wddx.
es: Debe saber que todas las funciones que serializan variables usan el primer elemento de un array para determinar si este ha de serializarse en forma de array o como estructura.

source: All the functions that serialize variables use the first element of an array to determine whether the array is to be serialized into an array or structure.
es: ?php print wddx_serialize_value( "Ejemplo de PHP a paquete WDDX", "Paquete PHP");?

source: ?php print wddx_serialize_value( "PHP to WDDX packet example", "PHP packet");?
es: wddxPacket version=' 0.9 'header comment='Paquete PHP' / data string Ejemplo de PHP a paquete WDDX / string / data / wddxPacket

source: ?php $pi = 3.1415926; $packet_id = wddx_packet_start("PHP"); wddx_add_vars($packet_id, "pi"); / * Suppose $cities came from database * / $cities = array("Austin", "Novato", "Seattle"); wddx_add_vars($packet_id, "cities"); $packet = wddx_packet_end($packet_id); print $packet;?
es: ?php $pi = 3.1415926; $packet_id = wddx_packet_start("PHP"); wddx_add_vars($packet_id, "pi"); / * Suponga que $ciudades se ha obtenido de una base de datos * / $ciudades = array("Austin", "Novato", "Seattle"); wddx_add_vars($packet_id, "ciudades"); $packet = wddx_packet_end($packet_id); print $packet;?

source: It is a standard defined by The World Wide Web consortium (W3C).
es: XML (eXtensible Markup Language) es un formato de información para el intercambio de documentos estructurado en la "Web "Es un estándar definido por el consorcio de la "World Wide Web" (W3C).

source: Information about XML and related technologies can be found at http: / /www.w3.org / XML /.
es: Se puede encontrar información sobre XML y tecnologís relacionadas en http: / /www.w3.org / XML /.

source: This PHP extension implements support for James Clark 's expat in PHP.
es: Esta extensión usa expat, que se puede encontrar en http: / /www.jclark.com / xml /.

source: It supports three source character encodings It supports three source character encodings also provided by PHP:
es: El Makefile que viene con expat no crea una biblioteca por defecto, se puede usar esta regla de make para eso:

source: UTF-16 is not supported.
es: Nota que si se usa Apache-1.3.7 o posterior, ya tienes la biblioteca requerida expat.

source: Each XML parser also has a few parameters you can adjust.
es: Simplemente, configura PHP usando --with-xml (sin ninguna ruta adicional) y usará automáticamente la biblioteca expat incluida en Apache.

source: This extension uses expat, which can be found at http: / /www.jclark.com / xml /.
es: En UNIX, ejecuta configure con la opción --with-xml.

source: The Makefile that comes with expat does not build a library by default, you can use this make rule for that:
es: La biblioteca expat debería ser instalada en algún lugar donde el compilador pueda encontrarlo.

source: These functions are enabled by default, using the bundled expat library.
es: Si se compila PHP como un módulo para Apache 1.3.9 o posterior, PHP automáticamente usará la biblioteca integrada expat de Apache.

source: If you compile PHP as a module for Apache 1.3.9 or later, PHP will automatically use the bundled expat library from Apache.
es: Compila PHP. ¡Ta-tam!

source: In order you dont 't want to use the bundled expat library configure PHP --with-expat-dir=DIR, where DIR should point to the base installation directory of expat.
es: Esta extensión de PHP implementa soporte para expat de James Clarkin en PHP.

source: The XML event handlers defined are:
es: Los gestores de eventos XML definidos son:

source: Supported XML handlers
es: Gestores de XML soportados

source: PHP function to set handler
es: Función PHP para establecer gestor

source: Event description
es: Descripción del evento

source: Element events are issued whenever the XML parser encounters start or end tags.
es: Los eventos de elemento ("element") se producen cuando el intérprete XML encuentra etiquetas de comienzo o fin.

source: There are separate handlers for start tags and end tags.
es: Hay gestores separados para etiquetas de comienzo y etiquetas de fin.

source: Character data is roughly all the non-markup contents of XML documents, including whitespace between tags.
es: La información de caracteres es, por definición, todo el contenido no "marcado" de los documentos XML, incluidos los espacios en blanco entre etiquetas.

source: Note that the XML parser does not add or remove any whitespace, it is up to the application (you) to decide whether whitespace is significant.
es: Nota que el intérprete XML no añade o elimina ningún espacio en blanco, depende de la aplicación (de ti) decidir si el espacio en blanco es significativo.

source: PHP programmers should be familiar with processing instructions (PIs) already. ?php? is a processing instruction, where php is called the "PI target ".
es: Los programadores de PHP deberían estar ya familiarizados con las instrucciones de procesado (PI). ?php? es una instrucción de procesado, donde php se denomina el "objetivo de procesado ".

source: The handling of these are application-specific, except that all PI targets starting with "XML" are reserved.
es: El manejo de éstos es específico a cada aplicación, salvo que todos los objetivos PI que comienzan con "XML" están reservados.

source: What goes not to another handler goes to the default handler.
es: Todo lo que no va a otro gestor, va al gestor por defecto.

source: You will get things like the XML and document type declarations in the default handler.
es: Se tendrán en el gestor por defecto cosas como las declaraciones de tipos de documento y XML.

source: This handler will be called for declaration of an unparsed (NDATA) entity.
es: Este gestor se llamará para la declaración de una entidad no analizada (NDATA).

source: This handler is called for declaration of a notation.
es: Este gestor se llama para la declaración de una anotación.

source: This handler is called when the XML parser finds a reference to an external parsed general entity.
es: Este gestor se llama cuando el intérprete XML encuentra una referencia a una entidad general interpretada externa.

source: This can be a reference to a file or URL, for example.
es: Puede ser una referencia a un archivo o URL, por ejemplo.

source: See the external entity example for a demonstration.
es: Ver el ejemplo de entidad externa para demostración.

source: The element handler functions may get their element names case-folded.
es: Las funciones manejadoras de elementos pueden tomar sus nombres de elementos "case-folded".

source: Case-folding is defined by the XML standard as "a process applied to a sequence of characters, in which those identified as non-uppercase are replaced by their uppercase equivalents".
es: Case-folding se define en el estándar XML como "un proceso aplicado a una secuencia de caracteres, en el cual aquellos identificados como sin-mayúsculas son reemplazados por sus equivalentes en mayúsculas".

source: In other words, when it comes to XML, case-folding simply means uppercasing.
es: En otras palabras, cuando se trata de XML, case-folding simplemente significa poner en mayúsculas.

source: By default, all the element names that are passed to the handler functions are case-folded.
es: Por defecto, todos los nombres de elementos que se pasan a las funciones gestoras estan "pasados a mayúsculas".

source: This behaviour can be queried and controlled per XML parser with the xml_parser_get_option() and xml_parser_set_option() functions, respectively.
es: Esta conducta puede ser observada y controlada por el analizador XML con las funciones xml_parser_get_option() y xml_parser_set_option(), respectivamente.

source: The following constants are defined for XML error codes (as returned by xml_parse()):
es: Las siguientes constantes se definen para códigos de error XML (como los devuelve xml_parse()):

source: PHP 's XML extension supports the Unicode character set through different character encoding s.
es: La extension XML de PHP soporta el conjunto de caracteres Unicode a través de diferentes codificaciones de caracteres.

source: There are two types of character encodings, source encoding and target encoding.
es: Hay dos tipos de codificaciones de caracteres, coficación de fuente y codificación de destino.

source: PHP 's internal representation of the document is always encoded with UTF-8.
es: La representación interna de PHP del documento está siempre codificada con UTF-8.

source: Source encoding is done when an XML document is parsed.
es: La codificación de fuente se hace cuando un documento XML es interpretado.

source: Upon creating an XML parser, a source encoding can be specified (this encoding can not be changed later in the XML parser's lifetime).
es: Al crear un intérprete XML, se puede especificar una codificación de fuente (esta codificación no se puede cambiar má tarde durante el tiempo de vida del intérprete XML).

source: The supported source encodings are ISO-8859-1, US-ASCII and UTF-8.
es: Las codificaciones de fuente soportadas son ISO-8859-1, US-ASCII y UTF-8.

source: The former two are single-byte encodings, which means that each character is represented by a single byte.
es: Las dos primeras son codificaciones de byte-único, lo que significa que cada carácter se representa por un solo byte.

source: UTF-8 can encode characters composed by a variable number of bits (up to 21) in one to four bytes.
es: UTF-8 puede codificar caracteres compuestos por un número variable de bits (hasta 21) en de uno a cuatro bytes.

source: The default source encoding used by PHP is ISO-8859-1.
es: La codificación fuente por defecto usada por PHP es ISO-8859-1.

source: Target encoding is done when PHP passes data to XML handler functions.
es: La codificación de destino se hace cuando PHP pasa datos a las funciones gestoras XML.

source: When an XML parser is created, the target encoding is set to the same as the source encoding, but this may be changed at any point.
es: Cuando se crea un intérprete XML, la codificación de destino se crea igual a la codificación de fuente, pero se puede cambiar en cualquier momento.

source: The target encoding will affect character data as well as tag names and processing instruction targets.
es: La codificación de destino afectará a la información de los caracteres así como a los nombres de las etiquetas y a los objetivos de instrucciones de procesado.

source: If the XML parser encounters characters outside the range that its source encoding is capable of representing, it will return an error.
es: Si el intérprete XML encuentra caracteres fuera del rango que su codificación de fuente es capaz de representar, devolverá un error.

source: If PHP encounters characters in the parsed XML document that can not be represented in the chosen target encoding, the problem characters will be "demoted".
es: Si PHP encuentra caracteres en el documento XML interpretado que no pueden ser representados en la codificación de destino elegida, los caracteres problema serán "degradados".

source: Currently, this means that such characters are replaced by a question mark.
es: Actualmente, esto significa que tales caracteres se reemplazan por un signo de interrogación.

source: Here are some example PHP scripts parsing XML documents.
es: Aquí hay algunos ejemplos de archivos de comandos PHP que interpretan documentos XML.

source: This first example displays the stucture of the start elements in a document with indentation.
es: Este primer ejemplo muestra la estructura del elemento inicio en un documento con indentación.

source: Show XML Element Structure
es: Muestra la Estructura del Elemento XML

source: Map XML to HTML
es: Traduciendo XML a HTML

source: This example maps tags in an XML document directly to HTML tags.
es: Este ejemplo transforma etiquetas de un documento XML directamente a etiquetas HTML.

source: Elements not found in the "map array" are ignored.
es: Los elementos no encontrados en el "array de traducción ("map array") son ignorados.

source: Of course, this example will only work with a specific XML document type.
es: Por supuesto, este ejemplo solamente funcionará con un tipo de documentos XML específico.

source: $file = "data.xml"; $map_array = array ("BOLD" = "B", "EMPHASIS "= "I", "LITERAL" = "TT "); function startElement($parser, $name, $attrs) {global $map_array; if ($htmltag = $map_array[$name]) {print" $htmltag ";}} function endElement($parser, $name) {global $map_array; if ($htmltag = $map_array[$name]) {print" / $htmltag ";}} function characterData($parser, $data) {print $data;} $xml_parser = xml_parser_create(); / / use case-folding so we are sure to find the tag in $map_array xml_parser_set_option($xml_parser, XML_OPTION_CASE_FOLDING, true); xml_set_element_handler($xml_parser, "startElement", "endElement"); xml_set_character_data_handler($xml_parser, "characterData"); if (!($fp = fopen($file, "r"))) {die("could not open XML input");} while ($data = fread($fp, 4096)) {if (!xml_parse($xml_parser, $data, feof($fp))) {die(sprintf("XML error: %s at line %d", xml_error_string(xml_get_error_code($xml_parser)), xml_get_current_line_number($xml_parser)));}} xml_parser_free($xml_parser);
es: $file = "data.xml"; $map_array = array ("BOLD" = "B", "EMPHASIS "= "I", "LITERAL" = "TT "); function startElement($parser, $name, $attrs) {global $map_array; if ($htmltag = $map_array[$name]) {print" $htmltag ";}} function endElement($parser, $name) {global $map_array; if ($htmltag = $map_array[$name]) {print" / $htmltag ";}} function characterData($parser, $data) {print $data;} $xml_parser = xml_parser_create(); / / usa case-folding para que estemos seguros de encontrar la etiqueta / / en $map_array xml_parser_set_option($xml_parser, XML_OPTION_CASE_FOLDING, true); xml_set_element_handler($xml_parser, "startElement", "endElement"); xml_set_character_data_handler($xml_parser, "characterData"); if (!($fp = fopen($file, "r"))) {die("could not open XML input");} while ($data = fread($fp, 4096)) {if (!xml_parse($xml_parser, $data, feof($fp))) {die(sprintf("XML error: %s at line %d", xml_error_string(xml_get_error_code($xml_parser)), xml_get_current_line_number($xml_parser)));}} xml_parser_free($xml_parser);

source: This example highlights XML code.
es: Este ejemplo resalta el código XML.

source: It illustrates how to use an external entity reference handler to include and parse other documents, as well as how PIs can be processed, and a way of determining "trust" for PIs containing code.
es: Ilustra cómo usar un gestor de referencia de entidades extenas para incluir y analizar otros documentos, así como cuúntos PIs pueden ser procesados, y un modo de determinar "confianza" para PIs que contienen código.

source: XML documents that can be used for this example are found below the example (xmltest.xml and xmltest2.xml.)
es: Los documentos XML que se pueden usar en este ejemplo se encuentran bajo el ejemplo (xmltest.xml y xmltest2.xml.)

source: External Entity Example
es: Ejemplo de Entidades Externas
